app/controllers/books_controller.rb

  def index
    @books = Book.all.order("created_at DESC")
---
SELECT "books".* FROM "books" ORDER BY created_at DESC

  def show
    @inspirations = Inspiration.where(book_id: @book.id)
---
SELECT "inspirations".* FROM "inspirations" WHERE "inspirations"."book_id" = 1

  def create
    @book = current_user.books.build(book_params)
    @book.preview = HTML_Truncator.truncate(@book.description, 20)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("created_at", "date_publish", "description", "genre", "link", "preview", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_book
      @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? ORDER BY "books"."id" ASC LIMIT 1  [["id", 1]]