app/controllers/favorites_controller.rb

	def create
		Favorite.create(favorited: @inspiration, user: current_user)
---
INSERT INTO "favorites" ("created_at", "favorited_id", "favorited_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 10 Oct 2014 10:17:47 UTC +00:00], ["favorited_id", 1], ["favorited_type", "Inspiration"], ["updated_at", Fri, 10 Oct 2014 10:17:47 UTC +00:00], ["user_id", 1]]

	def destroy
		Favorite.where(favorited_id: @inspiration.id, user_id: current_user.id).first.destroy
---
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."favorited_id" = 1 AND "favorites"."user_id" = 1 ORDER BY "favorites"."id" ASC LIMIT 1

	def set_inspiration
		@inspiration = Inspiration.find(params[:inspiration_id] || params[:id])
---
SELECT "inspirations".* FROM "inspirations" WHERE "inspirations"."id" = ? LIMIT 1  [["id", "1"]]