app/views/votes/_voter.html.erb

	<span class="glyphicon glyphicon-chevron-up"></span><% end %></div>
<div><strong><%= inspiration.votes.sum(:value).to_i %></strong></div>
---
SELECT SUM("votes"."value") AS sum_id FROM "votes" WHERE "votes"."inspiration_id" = ?  [["inspiration_id", 1]]